Repository: stanciugabriel/stash
Catalog: lib/l10n/app_*.arb
Languages: ro

source: Title
ro: Titlu

# welcome_message
source: Welcome!
ro: Bine ai venit!

source: Login
ro: Autentificare

source: Logout
ro: Deconectare

source: Settings
ro: Setări

# dark_mode
source: Dark
ro: Întunecat

# light_mode
source: Light
ro: Luminos

# system_mode
source: System
ro: Sistem

# card_title
source: Cards
ro: Carduri

source: Appearance
ro: Aspect

source: Color Scheme
ro: Schemă de culori

# color_scheme_description
source: Turn on dark mode, or let Stash visually match your device settings.
ro: Activează modul întunecat sau lasă Stash să se potrivească vizual cu setările dispozitivului tău.

source: Search...
ro: Caută...

source: Edit
ro: Editează

source: Share
ro: Distribuie

source: Delete
ro: Șterge

# edit_description
source: Edit your card details.
ro: Editează detaliile cardului tău.

# share_description
source: Share this card with your friends.
ro: Distribuie acest card cu prietenii tăi.

# delete_description
source: Permanently delete this card.
ro: Șterge acest card permanent.

source: Coming Soon.
ro: În Curând.

# coming_soon_description
source: In the meantime, subscribe to receive updates when we add new features.
ro: Între timp, abonează-te pentru a primi notificări când adăugăm funcții noi.

source: Subscribe
ro: Abonează-te

source: Subscribed
ro: Abonat

source: Account settings
ro: Setări cont

source: Preferences
ro: Preferințe

source: Notifications
ro: Notificări

source: Resources
ro: Resurse

source: Leave Feedback
ro: Lasă un feedback

source: Rate in App Store
ro: Evaluează în App Store

source: Sign out
ro: Deconectare

source: Version
ro: Versiune

# terms_and_privacy
source: Terms & Privacy
ro: Termeni & Confidențialitate

source: Push Notifications
ro: Notificări push

# add_manually_button
source: Or, add the card manually.
ro: Sau, adaugă cardul manual.

# scan_loyalty_card
source: Scan your loyaty card
ro: Scanează cardul tău

# card_name_title
source: Enter the name of the store
ro: Introdu numele magazinului

# card_name_description
source: Please enter the name of the store that issued the loyalty card.
ro: Te rugăm să introduci numele magazinului care a emis cardul de loialitate.

# continue_button
source: Continue
ro: Continuă

source: Language
ro: Limbă

# language_title
source: Change Language
ro: Schimbă Limba

# language_description
source: Choose your favourite language, or use the default language on your device.
ro: Alege limba ta preferată sau folosește limba implicită de pe dispozitivul tău.

source: Welcome to Stash
ro: Bun venit la Stash

source: Your loyalty cards, all in one place.
ro: Cardurile tale de loialitate, toate într-un singur loc.

source: Stash is better with an account
ro: Stash este mai bun cu un cont

# consider_acc
source: Consider creating one to unlock exclusive features like automatic backups and syncing your cards across devices. It only takes a moment and will make sure you never lose your data.
ro: Consideră crearea unui cont pentru a debloca funcții exclusive precum backup-uri automate și sincronizarea cardurilor tale pe dispozitive. Nu durează decât câteva momente și va asigura că nu îți vei pierde niciodată datele.

source: Create Account
ro: Creează cont

source: Continue Without
ro: Continuă fără

source: Store your loyalty cards
ro: Păstrează cardurile tale de loialitate

# keep_all_cards_securely_stored
source: Keep all cards stored securely.
ro: Păstrează toate cardurile în siguranță.

source: Share your cards with ease
ro: Împarte cardurile tale cu ușurință

source: Share cards with just a link.
ro: Împarte cardurile cu un simplu link.

source: Offline access
ro: Acces offline

# access_cards_without_an_internet_connection
source: Access cards with no internet.
ro: Accesează cardurile fără internet.

source: Automatic backup
ro: Backup automat

source: Backup cards and never lose them.
ro: Backup cardurilor și nu le pierde niciodată.

source: Create an account
ro: Creează un cont

source: Continue without an account
ro: Continuă fără un cont

source: Meet your new favourite loyalty app
ro: Fă cunoștință cu aplicația ta favorită de loialitate

# enter_the_barcode
source: Enter the barcode on your card
ro: Introdu codul de pe card

# enter_the_barcode_description
source: Please enter the code written on your loyalty card
ro: Introdu codul scris pe cardul tau de loialitate.

# how_does_your_barcode_look
source: How does your barcode look like?
ro: Cum arata codul tau de bare?

source: Account Details
ro: Detalii Cont

source: Basic Info
ro: Informații de bază

# name_details
source: Name
ro: Nume

source: Phone Number
ro: Număr de telefon

source: Delete Account
ro: Șterge Cont

source: Are you sure?
ro: Ești sigur?

# delete_account_warning
source: You will lose access to all the loyalty cards you have saved, both those stored in your account and those stored locally on your device, and will no longer be able to retrieve them.
ro: Vei pierde accesul la toate cardurile de loialitate pe care le-ai salvat, atât cele stocate în contul tău, cât și cele stocate local pe dispozitivul tău, și nu vei mai putea să le recuperezi.

source: This action cannot be reverted
ro: Această acțiune este ireversibilă.

# onboarding_phone_hint
source: Phone number
ro: Număr de telefon

# onboarding_otp_hint
source: One Time Password
ro: Codul OTP

# onboarding_surname_hint
source: Surname
ro: Numele de familie

# onboarding_firstname_hint
source: Name
ro: Prenumele

# onboarding_name_title
source: Let's get to know each other
ro: Hai să ne cunoaștem mai bine!

# onboarding_name_subtitle
source: Enter your name and surname
ro: Introdu numele și prenumele

# enter_received_code
source: Enter the received code
ro: Introdu codul primit

# sent_verification_code_sms
source: We sent you a verification code via SMS
ro: Ți-am trimis un cod de verificare prin SMS

# no_first_name_entered
source: You haven't entered a first name.
ro: Nu ai introdus un prenume.

# no_last_name_entered
source: You haven't entered a last name.
ro: Nu ai introdus un nume.

source: Incorrect phone number.
ro: Numărul de telefon incorect.

source: Continue with phone number
ro: Continuă cu numărul de telefon

# login_or_register_with_phone
source: Log in or sign up with phone number
ro: Loghează-te sau înregistrează-te cu numărul de telefon

source: Edit your card details
ro: Editează detaliile cardului tău

# you_can_change_both_name_and_id
source: You can edit both nickname and barcode
ro: Poți edita numele cardului și codul de bare

source: Nickname
ro: Nume

source: barcode
ro: Cod de bare

source: Add your first card
ro: Adaugă primul tău card

# noCardsYet
source: It looks like you don’t have any cards yet. Start by adding your first loyalty card to effortlessly breeze through checkouts.
ro: Se pare că nu ai încă niciun card. Începe prin a adăuga primul tău card de loialitate pentru a trece rapid prin casele de marcat.

source: New Card
ro: Card nou

source: Nicknamed:
ro: Denumit:

# editDetails
source: Edit
ro: Editează
